We'll talk about reshape2 package, and then dplyr and tidyr.

# reshape2 package
The goal is tidy data.
1. Each variable forms a coulmn.
2. Each observation forms a row.
3. Each table/file stores data about one kind of observation.

[Here](http://vita.had.co.nz/papers/tidy-data.pdf) is an interesting article about tidy data by Hadley Wickham.

Two functions to know:
- melt()
- dcast()

## melt()
melt 是熔化的意思，也就是將資料由多變數熔成較少變數且較長的資料

In [4]:
library(reshape2)
# we'll use mtcars dataset as an example
head(mtcars)
str(mtcars)

                  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1
                  carname
Mazda RX4         Mazda RX4
Mazda RX4 Wag     Mazda RX4 Wag
Datsun 710        Datsun 710
Hornet 4 Drive    Hornet 4 Drive
Hornet Sportabout Hornet Sportabout
Valiant           Valiant

'data.frame':	32 obs. of  12 variables:
 $ mpg    : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl    : num  6 6 4 6 8 6 8 4 4 6 ...
 $ disp   : num  160 160 108 258 360 ...
 $ hp     : num  110 110 93 110 175 105 245 62 95 123 ...
 $ drat   : num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt     : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec   : num  16.5 17 18.6 19.4 17 ...
 $ vs     : num  0 0 1 1 0 1 0 1 1 1 ...
 $ am     : num  1 1 1 0 0 0 0 0 0 0 ...
 $ gear   : num  4 4 4 3 3 3 3 4 4 4 ...
 $ carb   : num  4 4 1 1 2 1 4 2 2 4 ...
 $ carname: chr  "Mazda RX4" "Mazda RX4 Wag" "Datsun 710" "Hornet 4 Drive" ...

In [2]:
# melting data frames
mtcars$carname <- rownames(mtcars)
carMelt <- melt(mtcars, id = c("carname", "gear", "cyl"),
               measure.vars = c("mpg", "hp"))

head(carMelt, 3)
tail(carMelt, 3)
## note there are 64 rows (2 measure.vars * 32 observations)

  carname       gear cyl variable value
1 Mazda RX4     4    6   mpg      21.0
2 Mazda RX4 Wag 4    6   mpg      21.0
3 Datsun 710    4    4   mpg      22.8

   carname       gear cyl variable value
62 Ferrari Dino  5    6   hp       175
63 Maserati Bora 5    8   hp       335
64 Volvo 142E    4    4   hp       109

## dcast()
cast 是鑄造的意思，也就是將資料由較少變數鑄造成較多變數且較寬的資料

In [10]:
# cyl ~ variable表示想要了解cyl針對不同變量(melt時填入的mpg和hp)的劃分
# ~左側作為row來輸出，右側作為column來輸出
# the default of fun.aggregate is length
cylData <- dcast(carMelt, cyl ~ variable, fun.aggregate = length)
cylData
# 結果表示在4個汽缸(cylinder)的情況下，有11個mpg的測量值和11個hp的測量值
# 注意會按照cyl的值由小到大排列


cylData <- dcast(carMelt, cyl ~ variable, mean)
cylData

Your code contains a unicode char which cannot be displayed in your
current locale and R will silently convert it to an escaped form when the
R kernel executes this code. This can lead to subtle errors if you use
such chars to do comparisons. For more information, please see
https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows

  cyl mpg hp
1 4   11  11
2 6    7   7
3 8   14  14

  cyl mpg      hp
1 4   26.66364  82.63636
2 6   19.74286 122.28571
3 8   15.10000 209.21429

---

# dplyr package

Functions to know:
- select()
- filter()
- arrange()
- rename()
- mutate()
- group_by()
- summarize()

And an operator to know:
- %>%

dplyr properties:
1. The first argument is a data frame.
2. The subsequent arguments describe what to do with it, and you can refer to columns in the data frame directly without using the \$ operator (just use the names).
3. The result is a new data frame.
4. Data frames must be properly formatted and annotated for this to all be useful.

In [15]:
library(dplyr)
chicago <- readRDS("./data/chicago.rds")
dim(chicago)

[1] 6940    8

## select()
return a **subset of the columns** of a data frame

In [18]:
head(select(chicago, 1:5))

# we usually specify the column names insted of the index when using dplyr
names(chicago)[1:3]
head(select(chicago, city:dptp))
head(select(chicago, -(city:dptp)))

  city tmpd dptp   date       pm25tmean2
1 chic 31.5 31.500 1987-01-01 NA
2 chic 33.0 29.875 1987-01-02 NA
3 chic 33.0 27.375 1987-01-03 NA
4 chic 29.0 28.625 1987-01-04 NA
5 chic 32.0 28.875 1987-01-05 NA
6 chic 40.0 35.125 1987-01-06 NA

[1] "city" "tmpd" "dptp"

  city tmpd dptp
1 chic 31.5 31.500
2 chic 33.0 29.875
3 chic 33.0 27.375
4 chic 29.0 28.625
5 chic 32.0 28.875
6 chic 40.0 35.125

  date       pm25tmean2 pm10tmean2 o3tmean2 no2tmean2
1 1987-01-01 NA         34.00000   4.250000 19.98810
2 1987-01-02 NA               NA   3.304348 23.19099
3 1987-01-03 NA         34.16667   3.333333 23.81548
4 1987-01-04 NA         47.00000   4.375000 30.43452
5 1987-01-05 NA               NA   4.750000 30.33333
6 1987-01-06 NA         48.00000   5.833333 25.77233

## filter()
extract a **subset of rows** from a data frame based on **logical conditions**

In [20]:
chic.f <- filter(chicago, pm25tmean2 > 30)
head(select(chic.f, 1:3, pm25tmean2), 10)

chic.f <- filter(chicago, pm25tmean2 > 30 & tmpd > 80)
head(select(chic.f, 1:3, pm25tmean2), 10)

   city tmpd dptp pm25tmean2
1  chic 23   21.9 38.10
2  chic 28   25.8 33.95
3  chic 55   51.3 39.40
4  chic 59   53.7 35.40
5  chic 57   52.0 33.30
6  chic 57   56.0 32.10
7  chic 75   65.8 56.50
8  chic 61   59.0 33.80
9  chic 73   60.3 30.30
10 chic 78   67.1 41.40

   city tmpd dptp pm25tmean2
1  chic 81   71.2 39.6000
2  chic 81   70.4 31.5000
3  chic 82   72.2 32.3000
4  chic 84   72.9 43.7000
5  chic 85   72.6 38.8375
6  chic 84   72.6 38.2000
7  chic 82   67.4 33.0000
8  chic 82   63.5 42.5000
9  chic 81   70.4 33.1000
10 chic 82   66.2 38.8500

## arrange()
reorder rows of a data frame

In [22]:
chicago <- arrange(chicago, date)
head(select(chicago, date, pm25tmean2), 3)
tail(select(chicago, date, pm25tmean2), 3)

  date       pm25tmean2
1 1987-01-01 NA
2 1987-01-02 NA
3 1987-01-03 NA

     date       pm25tmean2
6938 2005-12-29  7.45000
6939 2005-12-30 15.05714
6940 2005-12-31 15.00000

In [24]:
# can be arranged in descending order too
chicago <- arrange(chicago, desc(date))
head(select(chicago, date, pm25tmean2), 3)
tail(select(chicago, date, pm25tmean2), 3)

  date       pm25tmean2
1 2005-12-31 15.00000
2 2005-12-30 15.05714
3 2005-12-29  7.45000

     date       pm25tmean2
6938 1987-01-03 NA
6939 1987-01-02 NA
6940 1987-01-01 NA

## rename()
rename variables in a data frame

In [25]:
head(chicago[, 1:5], 3)

chicago <- rename(chicago, dewpoint = dptp, pm25 = pm25tmean2)
head(chicago[, 1:5], 3)

  city tmpd dptp date       pm25tmean2
1 chic 35   30.1 2005-12-31 15.00000
2 chic 36   31.0 2005-12-30 15.05714
3 chic 35   29.4 2005-12-29  7.45000

  city tmpd dewpoint date       pm25
1 chic 35   30.1     2005-12-31 15.00000
2 chic 36   31.0     2005-12-30 15.05714
3 chic 35   29.4     2005-12-29  7.45000

## mutate()
add new variables/columns or transform existing variables

In [26]:
chicago <- mutate(chicago,
                 pm25detrend = pm25 - mean(pm25, na.rm = T))
head(select(chicago, pm25, pm25detrend))

  pm25     pm25detrend
1 15.00000 -1.230958
2 15.05714 -1.173815
3  7.45000 -8.780958
4 17.75000  1.519042
5 23.56000  7.329042
6  8.40000 -7.830958

## group_by() & summarize()
- group_by: group observations by facors
- summarize: generate summary statistics of different variables in the data frame, possibly within strata (work with group_by)

In [40]:
# *1是為了coerce成numeric(0,1)，而factor會由小排到大
chicago <- mutate(chicago, tempcat = factor(1 * (tmpd > 80),
                                           labels = c("cold", "hot")))
hotcold <- group_by(chicago, tempcat)
head(hotcold, 3)
summarize(hotcold, pm25 = mean(pm25, na.rm = T),
         o3 = max(o3tmean2), no2 = median(no2tmean2))

Your code contains a unicode char which cannot be displayed in your
current locale and R will silently convert it to an escaped form when the
R kernel executes this code. This can lead to subtle errors if you use
such chars to do comparisons. For more information, please see
https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows

  city tmpd dewpoint date       pm25     pm10tmean2 o3tmean2 no2tmean2
1 chic 35   30.1     2005-12-31 15.00000 23.5       2.531250 13.25000
2 chic 36   31.0     2005-12-30 15.05714 19.2       3.034420 22.80556
3 chic 35   29.4     2005-12-29  7.45000 23.5       6.794837 19.97222
  pm25detrend tempcat
1 -1.230958   cold
2 -1.173815   cold
3 -8.780958   cold

  tempcat pm25     o3        no2
1 cold    15.97807 66.587500 24.54924
2 hot     26.48118 62.969656 24.93870
3 NA      47.73750  9.416667 37.44444

In [42]:
chicago <- mutate(chicago, year = as.POSIXlt(date)$year + 1900)
years <- group_by(chicago, year)
summarize(years, pm25 = mean(pm25, na.rm = T),
         o3 = max(o3tmean2, na.rm = T),
         no2 = median(no2tmean2, na.rm = T))

   year pm25     o3       no2
1  1987      NaN 62.96966 23.49369
2  1988      NaN 61.67708 24.52296
3  1989      NaN 59.72727 26.14062
4  1990      NaN 52.22917 22.59583
5  1991      NaN 63.10417 21.38194
6  1992      NaN 50.82870 24.78921
7  1993      NaN 44.30093 25.76993
8  1994      NaN 52.17844 28.47500
9  1995      NaN 66.58750 27.26042
10 1996      NaN 58.39583 26.38715
11 1997      NaN 56.54167 25.48143
12 1998 18.26467 50.66250 24.58649
13 1999 18.49646 57.48864 24.66667
14 2000 16.93806 55.76103 23.46082
15 2001 16.92632 51.81984 25.06522
16 2002 15.27335 54.88043 22.73750
17 2003 15.23183 56.16608 24.62500
18 2004 14.62864 44.48240 23.39130
19 2005 16.18556 58.84126 22.62387

## %>%

In [48]:
chicago %>% 
mutate(month = as.POSIXlt(date)$mon + 1) %>% 
group_by(month) %>% 
summarize(pm25 = mean(pm25, na.rm = T), 
          o3 = max(o3tmean2, na.rm = T), 
          no2 = median(no2tmean2, na.rm = T))

   month pm25     o3       no2
1   1    17.76996 28.22222 25.35417
2   2    20.37513 37.37500 26.78034
3   3    17.40818 39.05000 26.76984
4   4    13.85879 47.94907 25.03125
5   5    14.07420 52.75000 24.22222
6   6    15.86461 66.58750 25.01140
7   7    16.57087 59.54167 22.38442
8   8    16.93380 53.96701 22.98333
9   9    15.91279 57.48864 24.47917
10 10    14.23557 47.09275 24.15217
11 11    15.15794 29.45833 23.56537
12 12    17.52221 27.70833 24.45773

---

# tidyr package
Functions to know:
- gather()
- spread()
- separate()

## gather() & spread()
spread is the reverse of gather

In [69]:
students <- data.frame(grade = c("A", "B", "C", "D", "E"),
                      male = c(1, 5, 5, 5, 7),
                      female = c(5, 0, 2, 5, 4))
students

  grade male female
1 A     1    5
2 B     5    0
3 C     5    2
4 D     5    5
5 E     7    4

In [71]:
# male and female should be in the same column called sex
# key: 將column name變成row的observation
# value: 將本來該在col的值轉換到col
# -grade表示除了grade column之外，其他column都要進行gather
library(tidyr)
gather(students, key = sex, value = count, -grade)

Attaching package: 'tidyr'

The following object is masked from 'package:reshape2':

    smiths

   grade sex    count
1  A     male   1
2  B     male   5
3  C     male   5
4  D     male   5
5  E     male   7
6  A     female 5
7  B     female 0
8  C     female 2
9  D     female 5
10 E     female 4

## separate()

In [77]:
students2 <- data.frame(grade = c("A", "B", "C", "D", "E"),
                      male_1 = c(3, 6, 7, 4, 1),
                      female_1 = c(4, 4, 4, 0, 1),
                       male_2 = c(3, 3, 3, 8, 2),
                       female_2 = c(4, 5, 8, 1, 7))
students2

  grade male_1 female_1 male_2 female_2
1 A     3      4        3      4
2 B     6      4        3      5
3 C     7      4        3      8
4 D     4      0        8      1
5 E     1      1        2      7

In [80]:
# two steps
res <- gather(students2, sex_class, count, -grade)
res

separate(data = res, col = sex_class, into = c("sex", "class"))

   grade sex_class count
1  A     male_1    3
2  B     male_1    6
3  C     male_1    7
4  D     male_1    4
5  E     male_1    1
6  A     female_1  4
7  B     female_1  4
8  C     female_1  4
9  D     female_1  0
10 E     female_1  1
11 A     male_2    3
12 B     male_2    3
13 C     male_2    3
14 D     male_2    8
15 E     male_2    2
16 A     female_2  4
17 B     female_2  5
18 C     female_2  8
19 D     female_2  1
20 E     female_2  7

   grade sex    class count
1  A     male   1     3
2  B     male   1     6
3  C     male   1     7
4  D     male   1     4
5  E     male   1     1
6  A     female 1     4
7  B     female 1     4
8  C     female 1     4
9  D     female 1     0
10 E     female 1     1
11 A     male   2     3
12 B     male   2     3
13 C     male   2     3
14 D     male   2     8
15 E     male   2     2
16 A     female 2     4
17 B     female 2     5
18 C     female 2     8
19 D     female 2     1
20 E     female 2     7

In [81]:
# or we can use %>% to make it clean
students2 %>%
gather(sex_class, count, -grade) %>%
separate(sex_class, c("sex", "class")) %>%
print

   grade    sex class count
1      A   male     1     3
2      B   male     1     6
3      C   male     1     7
4      D   male     1     4
5      E   male     1     1
6      A female     1     4
7      B female     1     4
8      C female     1     4
9      D female     1     0
10     E female     1     1
11     A   male     2     3
12     B   male     2     3
13     C   male     2     3
14     D   male     2     8
15     E   male     2     2
16     A female     2     4
17     B female     2     5
18     C female     2     8
19     D female     2     1
20     E female     2     7

## Common types of messy data:
1. Column headers are values, not variable names
2. Variables are stored in both rows and columns
3. A single observational unit is stored in multiple tables
4. Multiple types of observational units are stored in the same table
5. Multiple variables are stored in one column

We can use tidyr (with dplyr) to fix them!!! (we will only focus on the first three types)

### Variables are stored in both rows and columns

In [82]:
students3 <- read.csv("./data/students3.csv")
students3
# since variables are stored in both rows and columns,
# our goal are: 
# 1. midterm & final are variables, and should be in columns
# 2. five classes should be in the same variable

   name  test    class1 class2 class3 class4 class5
1  Sally midterm A             B
2  Sally final   C             C
3  Jeff  midterm        D             A
4  Jeff  final          E             C
5  Roger midterm        C                    B
6  Roger final          A                    A
7  Karen midterm               C      A
8  Karen final                 C      A
9  Brian midterm B                           A
10 Brian final   B                           C

In [83]:
# step 1: gather
students3 %>% 
gather(class, grade, -(name:test), na.rm = T) %>%
print

Warning message:
"attributes are not identical across measure variables; they will be dropped"

    name    test  class grade
1  Sally midterm class1     A
2  Sally   final class1     C
3   Jeff midterm class1
4   Jeff   final class1
5  Roger midterm class1
6  Roger   final class1
7  Karen midterm class1
8  Karen   final class1
9  Brian midterm class1     B
10 Brian   final class1     B
11 Sally midterm class2
12 Sally   final class2
13  Jeff midterm class2     D
14  Jeff   final class2     E
15 Roger midterm class2     C
16 Roger   final class2     A
17 Karen midterm class2
18 Karen   final class2
19 Brian midterm class2
20 Brian   final class2
21 Sally midterm class3     B
22 Sally   final class3     C
23  Jeff midterm class3
24  Jeff   final class3
25 Roger midterm class3
26 Roger   final class3
27 Karen midterm class3     C
28 Karen   final class3     C
29 Brian midterm class3
30 Brian   final class3
31 Sally midterm class4
32 Sally   final class4
33  Jeff midterm class4     A
34  Jeff   final class4     C
35 Roger midterm class4
36 Roger   final class4
37 Karen midterm class4     A
38 Karen   final class4     A
39 Brian midterm class4
40 Brian   final class4
41 Sally midterm class5
42 Sally   final class5
43  Jeff midterm class5
44  Jeff   final class5
45 Roger midterm class5     B
46 Roger   final class5     A
47 Karen midterm class5
48 Karen   final class5
49 Brian midterm class5     A
50 Brian   final class5     C

In [87]:
# step 2: spread and remove the word "class"
students3 %>% 
gather(class, grade, -(name:test), na.rm = T) %>%
spread(test, grade) %>%
mutate(class = readr::parse_number(class)) %>%
print

Warning message:
"attributes are not identical across measure variables; they will be dropped"

    name class final midterm
1  Brian     1     B       B
2  Brian     2
3  Brian     3
4  Brian     4
5  Brian     5     C       A
6   Jeff     1
7   Jeff     2     E       D
8   Jeff     3
9   Jeff     4     C       A
10  Jeff     5
11 Karen     1
12 Karen     2
13 Karen     3     C       C
14 Karen     4     A       A
15 Karen     5
16 Roger     1
17 Roger     2     A       C
18 Roger     3
19 Roger     4
20 Roger     5     A       B
21 Sally     1     C       A
22 Sally     2
23 Sally     3     C       B
24 Sally     4
25 Sally     5

### Multiple observational units are stored in the same table

In [89]:
students4 <- read.csv("./data/students4.csv")
students4
# id, name, and sex show up two times
# our goal is:
# break this data frame into two separate df, 
# one for id, class, and sex
# and the other for id, class, midterm, and final

   id  name  sex class midterm final
1  168 Brian F   1     B       B
2  168 Brian F   5     A       C
3  588 Sally M   1     A       C
4  588 Sally M   3     B       C
5  710 Jeff  M   2     D       E
6  710 Jeff  M   4     A       C
7  731 Roger F   2     C       A
8  731 Roger F   5     B       A
9  908 Karen M   3     C       C
10 908 Karen M   4     A       A

In [91]:
# step 1
student_info <- students4 %>%
    select(id, name, sex) %>%
    unique() %>%
    print

   id  name sex
1 168 Brian   F
3 588 Sally   M
5 710  Jeff   M
7 731 Roger   F
9 908 Karen   M

In [92]:
# step 2
gradebook <- students4 %>%
    select(id, class, midterm, final) %>%
    print

    id class midterm final
1  168     1       B     B
2  168     5       A     C
3  588     1       A     C
4  588     3       B     C
5  710     2       D     E
6  710     4       A     C
7  731     2       C     A
8  731     5       B     A
9  908     3       C     C
10 908     4       A     A

### Single observational unit is stored in multiple tables

In [93]:
passed <- data.frame(name = c("Brian", "Roger", "Roger", "Karen"),
                    class = c(1, 2, 5, 4),
                    final = c("B", "A", "A", "A"))
failed <- data.frame(name = c("Brian", "Sally", "Sally", "Jeff", "Jeff", "Karen"),
                    class = c(5, 1, 3, 2, 4, 3),
                    final = c("C", "C", "C", "E", "C", "C"))
passed
failed

  name  class final
1 Brian 1     B
2 Roger 2     A
3 Roger 5     A
4 Karen 4     A

  name  class final
1 Brian 5     C
2 Sally 1     C
3 Sally 3     C
4 Jeff  2     E
5 Jeff  4     C
6 Karen 3     C

In [94]:
# step 1: Before joining the two tables together, 
# we'll add a new column to each containing 'status' 
# so that it's not lost when we put everything together.
passed <- passed %>% 
    mutate(status = "passed")
failed <- failed %>%
    mutate(status = "failed")

In [95]:
# step 2: use bind_rows() in dplyr
bind_rows(passed, failed)

Warning message in bind_rows_(x, .id):
"Unequal factor levels: coercing to character"Warning message in bind_rows_(x, .id):
"binding character and factor vector, coercing into character vector"Warning message in bind_rows_(x, .id):
"binding character and factor vector, coercing into character vector"Warning message in bind_rows_(x, .id):
"Unequal factor levels: coercing to character"Warning message in bind_rows_(x, .id):
"binding character and factor vector, coercing into character vector"Warning message in bind_rows_(x, .id):
"binding character and factor vector, coercing into character vector"

   name  class final status
1  Brian 1     B     passed
2  Roger 2     A     passed
3  Roger 5     A     passed
4  Karen 4     A     passed
5  Brian 5     C     failed
6  Sally 1     C     failed
7  Sally 3     C     failed
8  Jeff  2     E     failed
9  Jeff  4     C     failed
10 Karen 3     C     failed

---

# Merging Data

In [57]:
coords <- read.csv("./data/cities-coords.csv", header = T, sep = ",")
data <- read.csv("./data/cities-data.csv", header = T, sep = ",")
coords
data

  City          State Latitude Longitude
1 San Francisco CA    37.77823 -122.44250
2 New York      NY    40.71427  -74.00597
3 Los Angeles   CA    34.05223 -118.24368
4 Chicago       IL    41.85003  -87.65005
5 Dallas        TX    32.78306  -96.80667
6 Columbus      GA    32.46098  -84.98771
7 Columbus      OH    39.96118  -82.99879

   city          state year population
1  New York      NY    2012 8336697
2  New York      NY    2010 8175133
3  Los Angeles   CA    2012 3857799
4  Chicago       IL    2012 2714856
5  San Francisco CA    2012  825863
6  San Francisco CA    2010  805235
7  Houston       TX    2012 2160821
8  Columbus      GA    2012  198413
9  Columbus      OH    2012  809798
10 Columbus      OH    2010  787033

In [59]:
# merge coords & data by city & state
dataCoords <- merge(coords, data,
                   by.x = c("City", "State"),
                   by.y = c("city", "state"),
                   all.x = F,
                   all.y = T)

dataCoords

   City          State Latitude Longitude  year population
1  Chicago       IL    41.85003  -87.65005 2012 2714856
2  Columbus      GA    32.46098  -84.98771 2012  198413
3  Columbus      OH    39.96118  -82.99879 2012  809798
4  Columbus      OH    39.96118  -82.99879 2010  787033
5  Los Angeles   CA    34.05223 -118.24368 2012 3857799
6  New York      NY    40.71427  -74.00597 2012 8336697
7  New York      NY    40.71427  -74.00597 2010 8175133
8  San Francisco CA    37.77823 -122.44250 2012  825863
9  San Francisco CA    37.77823 -122.44250 2010  805235
10 Houston       TX          NA         NA 2012 2160821

In [61]:
# another merging method
# using join() in the plyr package
## faster, but less full features
library(plyr)
df1 <- data.frame(id = sample(1:10), x = rnorm(10))
df2 <- data.frame(id = sample(1:10), y = rnorm(10))
arrange(join(df1, df2), id)

------------------------------------------------------------------------------
You have loaded plyr after dplyr - this is likely to cause problems.
If you need functions from both plyr and dplyr, please load plyr first, then dplyr:
library(plyr); library(dplyr)
------------------------------------------------------------------------------

Attaching package: 'plyr'

The following objects are masked from 'package:dplyr':

    arrange, count, desc, failwith, id, mutate, rename, summarise,
    summarize

Joining by: id

   id x          y
1   1 -0.7735228  0.6861638
2   2  1.5731800  0.8514024
3   3 -0.3524796 -0.3898238
4   4 -1.9012904 -1.3737024
5   5 -0.5313481  0.3550426
6   6 -1.2645187 -1.0039664
7   7 -1.6209861 -0.3815649
8   8  0.2930139  1.6782415
9   9  1.1125962 -0.3209798
10 10  0.3044396 -1.6855687

In [62]:
# if you have multiple data frames
df1 <- data.frame(id = sample(1:10), x = rnorm(10))
df2 <- data.frame(id = sample(1:10), y = rnorm(10))
df3 <- data.frame(id = sample(1:10), z = rnorm(10))
dfList <- list(df1, df2, df3)
join_all(dfList)

Joining by: id
Joining by: id

   id x           y          z
1   3  0.94856980  1.3222448  0.9918249
2   6 -0.18954183  0.3957231 -0.5809540
3   5 -0.53914127  0.3684875  0.5265015
4   8 -0.27056449  3.1631313 -0.5428601
5   1 -0.27300777  1.1342044  0.8821765
6   7  0.90252058 -1.2114279 -0.2014216
7   4  0.99000606 -0.5982653  0.9074505
8   9 -0.97151924 -0.7610149  0.2665697
9  10 -0.03449454  0.1586690 -0.3526112
10  2  0.68138987 -0.8286826 -0.3884885